# todo: Определить в коде переменные:
# 1. Целочисленного типа
# 2. Вещественного типа
# 3. Логического типа
# 4. Строкового типа
# 5. Пустого типа
# Вывести их типы (надо погуглить).
x = 1 # определение целочисленного типа
y = 1.9 # определение вещественного типа
r = True # определение логического типа
text = "Hello" # определение строкового типа
no = None # определение пустого типа
print(type(x), type(y), type(r), type(text), type(no), sep='\n') # вывод типов