#todo: Написать программу, которая считывает два числа и выводит их сумму, разность, частное, произведение,
# результат целочисленного деления, результат деления с остатком, результат возведения в степень.
x,y = int(input()),int(input())
print(f"Сумма: {x+y}")
print(f"Разность: {x-y}")
print(f"Частное: {x/y}")
print(f"Произведение: {x*y}")
print(f"Целочисленное деление: {x//y}")
print(f"Результат деления с остатком: {x%y}")
print(f"Результат возведения в степень: {x**y}")




